opinion-box/app/controllers/post_controller.rb

SELECT "posts".* FROM "posts"
---
  def show
    @posts = Post.all

INSERT INTO "posts" ("main_text", "category", "contact", "can_viewing", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["main_text", "111"], ["category", 2], ["contact", "1111"], ["can_viewing", "2"], ["created_at", "2018-03-24 05:00:33.702982"], ["updated_at", "2018-03-24 05:00:33.702982"]]
---
  def create
    @post = create_post_params
    if @post.save